In [1]:
import sys
sys.version

'3.8.8 (default, Feb 24 2021, 15:54:32) [MSC v.1928 64 bit (AMD64)]'

In [3]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.2.2
1.20.0

## pd.merge()

In [7]:
dict1 = {'name':['홍길동', '홍길동', '김철수', '박영희', '김철수','김철수','홍길동'],
        'korean':range(7)}
dict2 = {'name':['김철수', '홍길동', '심수봉'],
        'english':range(3)}
df1 = pd.DataFrame(dict1)
df2 = pd.DataFrame(dict2)

In [8]:
df1

  name  korean
0  홍길동       0
1  홍길동       1
2  김철수       2
3  박영희       3
4  김철수       4
5  김철수       5
6  홍길동       6

In [9]:
df2

  name  english
0  김철수        0
1  홍길동        1
2  심수봉        2

In [11]:
df3 = pd.merge(df1, df2, on='name', how='inner')  #겹치는 데이터만 가져옴 두 데이터 프레임에서 겹치는 데이터만
df3

  name  korean  english
0  홍길동       0        1
1  홍길동       1        1
2  홍길동       6        1
3  김철수       2        0
4  김철수       4        0
5  김철수       5        0

In [12]:
df4 = pd.merge(df1, df2, on='name', how='outer')  #겹치는 데이터만 가져옴 두 데이터 프레임에서 겹치는 데이터만
df4

  name  korean  english
0  홍길동     0.0      1.0
1  홍길동     1.0      1.0
2  홍길동     6.0      1.0
3  김철수     2.0      0.0
4  김철수     4.0      0.0
5  김철수     5.0      0.0
6  박영희     3.0      NaN
7  심수봉     NaN      2.0

In [14]:
pd.merge(df1, df2, on='name', how='right')

  name  korean  english
0  김철수     2.0        0
1  김철수     4.0        0
2  김철수     5.0        0
3  홍길동     0.0        1
4  홍길동     1.0        1
5  홍길동     6.0        1
6  심수봉     NaN        2

In [15]:
s1 = pd.Series([0,1], index=list('ab'))
s2 = pd.Series([2,3,4], index=list('cde'))
s1 = pd.Series([5,6], index=list('fg'))

In [16]:
s1

f    5
g    6
dtype: int64